debugging.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to Debug Programs</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="How to Debug Programs"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-27T16:34+0300"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.ico" />
<link rel="apple-touch-icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.png" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">How to Debug Programs</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Debuggers are almost always bad</a></li>
<li><a href="#sec-2">2 Program with debugging in mind</a></li>
<li><a href="#sec-3">3 Think carefully about your data</a></li>
<li><a href="#sec-4">4 Don't remove the scaffolding (פיגומים)</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Debuggers are almost always bad</h2>
<div class="outline-text-2" id="text-1">


<p>
Debugging programs using a debugger is almost always the wrong thing. 
</p>
<ul>
<li>Debuggers allow you to trace or step through your program, check various variables, etc. 
</li>
<li>Most debuggers are not very convenient when chansing pointers (traversing a complex data structure with pointers going from one structure to the next), or examining the activation frames on the stack, or debugging different threads or processes.
</li>
<li>Debuggers do not understand your algorithms &amp; data structures. Their concept of a &ldquo;bug&rdquo; is limited to some exceptional circumstance that that triggers their invocation. This is hardly ever the right level to be debugging your code. It fails to capture what a &ldquo;bug&rdquo; means for <i>your</i> specific application:
<ul>
<li>What situations are problematic
</li>
<li>What happens to your data structures in these problematic situations
</li>
<li>What happens to the control of your program in these problematic situations
</li>
</ul>

</li>
<li>Some common errors do not occur when the program is run within the debugger. 
</li>
<li>Rather than focusing on their bugs, programmers waste time trying to reach strange places in the control and data of their program from inside the debugger. They spend a lot of time trying to recreate the circumstances that trigger the bug (before they understand the bug and therefore, what are the relevant circumstances to re-create it). One obvious problem with this approach is that bugs can be created in one place in the code and manifest themselves much later, in another place in the code. The most you can see in the debugger is the damage left by something that happened some time and many source lines ago.
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Program with debugging in mind</h2>
<div class="outline-text-2" id="text-2">


<p>
The easiest way to program
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Think carefully about your data</h2>
<div class="outline-text-2" id="text-3">


<p>
Testing is a very powerful tool. It is so powerful, that if you don't choose your inputs carefully the results can very easily mislead you. 
</p>
<p>
A student in the compilers course sent me the following session in Scheme:
</p>



<pre class="example">&gt; (define f 
    (lambda (x)
      (lambda (y)
        (+ x y))))
&gt; (((f 1) 2) 3)

Exception: attempt to apply non-procedure 3
Type (debug) to enter the debugger.
</pre>


<p>
He was trying to figure out what went wrong in his compiler: Why was the third argument being applied?
</p>
<p>
In fact, there was nothing wrong with his compiler, and the third "argument" wasn't being applied. A different choice of inputs would have uncovered the problem immediately:
</p>



<pre class="example">&gt; (((f 1) 2) 4)

Exception: attempt to apply non-procedure 3
Type (debug) to enter the debugger.
</pre>


<p>
The <code>3</code> that was being applied here was the result of adding <code>1</code> and <code>2</code>, and not the third argument&hellip; The student's error came from mis-applying a Curried, two-variable function to three arguments, so that the sum of <code>(+ x y)</code> got applied to the "third argument", and not vice versa. The poor choice of inputs carefully masked the real issue, by falsely implying that the third argument got applied somehow. 
</p>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Don't remove the scaffolding (פיגומים)</h2>
<div class="outline-text-2" id="text-4">


<p>
Programmers are ashamed of debug statements. Especially if they were added haphazardly, as an after-thought. They are all too eager to declare the program correct, and remove those shameful reminders of past mistakes. <a href="http://en.wikipedia.org/wiki/Murphy's_law">Murphy's Law</a> dictates, however, that as soon as you remove your debugging statements, new bugs are discovered, and you end up having to re-write your debugging code <i>again</i>. And then <i>again</i>. And then some. So by God, never remove the debugging code! Organize it, improve it, re-factor it, make it less intrusive, but keep it in place, because you <i>shall</i> need it some day.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-07-27T16:34+0300</p>
<p class="author">Author: Mayer Goldberg</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
